-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: Feb 19, 2026 at 10:16 AM
-- Server version: 10.4.32-MariaDB
-- PHP Version: 8.2.12

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `test`
--

-- --------------------------------------------------------

--
-- Table structure for table `catbreeds`
--

CREATE TABLE `catbreeds` (
  `id` int(11) NOT NULL,
  `name_th` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL,
  `name_en` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL,
  `description` text CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL,
  `characteristics` text CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `care_instructions` text CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `image_url` varchar(2083) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `is_visible` tinyint(1) NOT NULL DEFAULT 1
) ENGINE=InnoDB DEFAULT CHARSET=latin1 COLLATE=latin1_swedish_ci;

--
-- Dumping data for table `catbreeds`
--

INSERT INTO `catbreeds` (`id`, `name_th`, `name_en`, `description`, `characteristics`, `care_instructions`, `image_url`, `is_visible`) VALUES
(10, 'แมวเปอร์เซีย', 'Persian', 'ราชินีแมวจากแดนตะวันออกกลาง ซึ่งมีถิ่นกําเนิดอยู่ในแถบเปอร์เซีย หรือประเทศตุรกีกับอิหร่านในปัจจุบัน แมวเปอร์เซียถือ', 'แมวเปอร์เซีย เป็นแมวที่มีขนาดกลางถึงขนาดใหญ่ มีกระดูกที่ใหญ่และแข็งแรง หัวและหน้ากลม หน้าผากโหนก แก้มเต็ม\nดวงตากลมโต และอยู่ในตําแหน่งที่ห่างกัน มีจมูกที่หัก กล่าวคือ สังเกตได้ชัดเจนเมื่อมองจากด้านข้างจะเห็นจุดหักระหว่างจมูกกับหน้าผาก\nชัดเจน เมื่อมองจากด้านหน้าจะเห็นเป็นขีดอยู่ระหว่างดวงตา\nนอกจากหน้าตาที่น่ารักแล้ว ยังเป็นแมวที่มีอุปนิสัยอ่อนโยน เข้ากับคนอื่นได้ง่าย มีความร่าเริงซุกซน ปีนป่ายไปตามจุดต่าง ๆ\n', 'เมื่อตัดสินใจจะเลี้ยงแมวพันธุ์นี้แล้ว จงพึงระลึกไว้เสมอว่า การดูแลขนของแมวเปอร์เซียเป็นสิ่งที่จําเป็นอย่างยิ่ง ผู้เลี้ยงต้องหมั่น\nทําความสะอาด โดยการแปรงและสางขนแมวอย่างสม่ําเสมอ จะช่วยป้องกันการเกิดขนพันกัน ซึ่งอาจกลายเป็นแหล่งเพาะพันธุ์เชื้อโรค\nรวมทั้งพยาธิต่าง ๆ ที่จะเป็นสาเหตุของโรคผิวหนังอักเสบและเป็นที่อยู่ของเห็บหมัดอีกด้วย', 'https://img.thaicdn.net/u/2018/Jarosphan/Pet/Cat/166/01.jpg', 1),
(11, 'แมวอเมริกัน ชอร์ตแฮร์', 'American Shorthair', 'แมวสายพันธุ์อเมริกาที่สืบเชื้อสายมาจากประเทศในแถบยุโรป และแพร่พันธุ์มายังอเมริกา เมื่อสมัยที่ชาวยุโรปเดินทางไป\nแสวงหาถิ่นที่อยู่ใหม่ โดยพวกเขาได้นําแมวอเมริกันชอร์ตแฮร์ ติดเรือไปด้วย เพื่อป้องกันไม่ให้หนูทําลายข้าวของ และได้มีการพัฒนาสาย พันธุ์ในเวลาต่อมา จนกระทั่งกลายเป็นแมวพื้นเมืองขนสั้นของอเมริกาไปในที่สุด', 'สําหรับรูปร่างของแมวอเมริกัน ชอร์ตแฮร์ มีขนาดกลางไปจนถึงขนาดใหญ่ โครงสร้างลําตัวโต มีกล้ามเนื้อแข็งแรง มองเห็น ชัดเจน อกใหญ่ ขาใหญ่ ใบหูมีขอบเป็นทรงกลมมน ส่วนหัวมีลักษณะรูปไข่ ดวงตากลมโตเป็นสีเขียวมรกต มีลักษณะสีขน และรูปร่างมากกว่า 80 แบบ', 'ปัญหาของแมวพันธุ์อเมริกันขนสั้นส่วนใหญ่จะเป็นเชื้อราและเป็นหวัดง่าย ถ้าหากเจ้าของให้การดูแลไม่ดีก็จะเลี้ยงลําบาก\nฉะนั้นเจ้าของควรพาแมวไปตรวจสุขภาพและฉีดวัคซีนเป็นประจํา ส่วนปัญหาเรื่องขนร่วงมีน้อยมาก โดยจะร่วงเฉพาะในช่วงเวลาผลัดขนปีละ 2 ครั้งเท่านั้น', 'https://img.thaicdn.net/image/pet/450px-91092531_59d9d45235_b.jpg', 1),
(12, 'แมวสก็อตติช โฟลด์', 'Scottish Fold', 'Susie เป็นแมวพันธุ์สก็อตติช โฟลด์ ตัวแรกที่ถูกค้นพบในปี ค.ศ. 1961 ที่ประเทศสก็อตแลนด์ แต่ในตอนนั้นยังไม่มีใครทราบ\nชื่อสายพันธุ์ที่แท้จริง เนื่องจากลักษณะของ Susie มีใบหูพับ และยังมีใบหน้าที่คล้ายกับนกฮูก ซึ่งหลังจากที่ Susie ให้กําเนิดลูกแมวน้อยหูพับ 2 ตัว William Ross ชายเลี้ยงแกะ ซึ่งเป็นผู้ค้นพบคนแรกก็ได้นําลูกแมวตัวเมียไปเลี้ยง หลังจากที่ลูกแมวตัวนั้นโตขึ้น จึงนําไปผสมพันธุ์ กับ บริติช ชอร์ตแฮร์จนกลายเป็นต้นกําเนิดของสายพันธุ์นี้และได้รับการจดทะเบียนอย่างถูกต้องที่รับรองโดย The Governing Councilof the Cat Fancy ของประเทศอังกฤษ ในปี ค.ศ. 1966', 'แมวสายพันธุ์นี้แบ่งออกเป็น 2 แบบคือ แบบขนสั้นกับแบบขนยาว โดยทั้ง 2 แบบจะมีลักษณะตัวกลม หัวกลม มีช่วงคอสั้น\nดวงตากลมใหญ่และมีหูตั้งตรงขนาดกลาง ไปจนถึงหูพับขนาดเล็กที่มีมุมพับกว้าง ปลายหูส่วนใหญ่จะกลม หูของลูกแมวจะเริ่มพับในช่วง 2-3 อาทิตย์แรก จมูกสันโค้งกว้างรับกับดวงตา ซึ่งบางตัวมีปากโค้งได้รูปรับกับคางพอดีจึงเป็นที่มาของสมญานามว่า Smiling Cat หรือ แมวยิ้ม นั่นเอง', 'การดูแลแมวสก็อตติช โฟลด์ ค่อนข้างง่าย แค่หมั่นแปรงขน 1-2 ครั้งต่อสัปดาห์สําหรับแบบขนสั้น แต่อาจจะต้องเพิ่มการดูแล\nมากขึ้นหากเลือกที่จะเลี้ยงแบบขนยาว โดยเฉพาะบริเวณใบหูของแมว ควรหมั่นทําความสะอาดบ่อยครั้ง พอ ๆ กับการแปรงขน และ โดยทั่วไป แมวพันธุ์นี้ส่วนใหญ่มีร่างกายที่ค่อนข้างสมบูรณ์อยู่แล้ว จึงไม่มีเรื่องอะไรที่น่าเป็นห่วงนัก', 'https://img.thaicdn.net/image/pet/scottish-fold-04.jpg', 1),
(13, 'แมววิเชียรมาศ', 'Siamese', 'แมวไทยที่ชาวต่างชาติรู้จักกันดีในชื่อ Siamese Cat หรือ แมวสยาม หนึ่งในต้นตระกูลของแมวไทยที่ถูกนําไปปรับปรุงจนเกิด\nแมวไทยอีกหลากหลายสาย พันธุ์ ซึ่งตามตํานานสมุดข่อยได้กล่าวไว้ว่า หากใครได้เลี้ยงแมววิเชียรมาศ จะได้เป็นขุนนาง เพราะถือว่าแมว วิเชียรมาศเป็นแมวลาภ อีกทั้งในอดีตยังเป็นแมวที่เลี้ยงกันในวังเป็นส่วนใหญ่ด้วย', 'เนื่องจากแมววิเชียรมาศเป็นแมวที่มีแต้มสีน้ําตาลเข้ม 9 จุดอยู่บนตัว ได้แก่ ที่ปลายเท้าทั้งสี่ ปลายหูทั้งสอง ปลายหาง บนจมูก\nและที่อวัยวะเพศ ดังนั้นจึงถูกคนเข้าใจผิดบ่อย ๆ ว่า เป็นแมวเก้าแต้ม แต่ที่จริงแล้ว แมวเก้าแต้มเป็นชื่อของแมวไทยอีกชนิดหนึ่งที่สูญพันธุ์ไปแล้ว', 'ตอนกลางวันควรให้แมวอยู่อย่างอิสระในบ้านหรือนอกบ้านก็ได้ตอนกลางคืนควรขังรวมกันไว้ในกรง กรงแมวต้องมีขนาดใหญ่\nการเลี้ยงแมวในบ้าน แมวจะชอบขับถ่ายในที่ที่มีกลิ่นเหม็นหรือเป็นจุดอับ หากต้องการให้แมวขับถ่ายเป็นที่เป็นทาง ควรเตรียมกระบะทรายไว้ในบ้านด้วย แต่ที่ต้องระวังคือแมวตัวผู้ที่โตแล้ว มักจะขับถ่ายไม่เลือกที่', 'https://img.thaicdn.net/u/2018/Jarosphan/Pet/Cat/165/01.jpg', 1),
(14, 'แมวโคราช', 'Korat', 'แมวพันธุ์นี้มีชื่อเรียกมากมาย ไม่ว่าจะเป็น แมวมาเลศ แมวดอกเลา หรือแมวสีสวาด เป็นหนึ่งใน 17 แมวมงคลของไทย ที่ได้รับ\nพระราชทานชื่อมาจาก สมเด็จพระรามาธิบดีที่ 5 ตามแหล่งกําเนิดของแมวพันธุ์นี้ ซึ่งพบใน อ.พิมาย จ.นครราชสีมา ชื่อเสียงของแมว โคราชโด่งดังไปทั่วโลก หลังจากชนะเลิศงานประกวดประจําปีที่สหรัฐอเมริกา ในปี ค.ศ.1966', 'ลักษณะของแมวโคราชจะมีขนเรียบ โคนขนสีเทาขุ่น ๆ ส่วนปลายขนเป็นสีเงินประกายคล้ายหยดน้ําค้างบนใบบัว หรือผมหงอก และเป็นสีเช่นนี้ตลอดทั้งตัวตั้งแต่หัวจรดปลายหาง สําหรับใบหน้าหากมองดูจากด้านหน้าจะเห็นเป็นรูปหัวใจ หน้าผากใหญ่และแบน หูตั้ง ปลายหูมน โคนหูใหญ่สําหรับแมวตัวผู้บริเวณหน้าผากจะมีรอยหยักทําให้เห็นเป็นรูปหัวใจเด่นชัดมาก ขึ้น ผิวหนังที่บริเวณจมูกและริม ฝีปาก จะเป็นสีเงินหรือม่วงอ่อน', 'โดยปกติแล้วแมวโคราชจะมีอายุขัยเฉลี่ยอยู่ที่ 10-15 ปี ซึ่งวิธีการดูแลเหมือนแมวไทยทั่วไป แต่ค วรใส่ใจเรื่องการถ่ายพยาธิ\nและการฉีดวัคซีนมากเป็นพิเศษ โดยเฉพาะการฉีดวัคซีน 3 ชนิดต่อปีให้ครบถ้วน ซึ่งประกอบไปด้วย วัคซีนป้องกันหัดแมว ลูคีเมีย และพิษ สุนัขบ้า', 'https://img.thaicdn.net/image/korat.jpg', 1),
(15, 'แมวขาวมณี', 'Khao Manee', 'สําหรับแมวขาวมณีไม่มีหลักฐานยืนยันที่มาอย่างชัดเจน รู้เพียงว่า เริ่มพบเห็นมากในช่วงรัตนโกสินทร์ตอนต้น โดยมีข้อ\nสันนิษฐานว่า น่าจะเป็นแมวที่ติดมากับเรือสําเภาของพ่อค้าจีน ที่เลี้ยงไว้จับหนูบนเรือ แต่เนื่องจากสีขาวเป็นสีที่ดูสะอาดและเป็นสีมงคล สําหรับคนไทย ดังนั้นแมวขาวมณีจึงกลายเป็นแมวบ้านนับจากนั้นเป็นต้นมา และที่สําคัญแมวพันธุ์นี้ยังเป็นแมวที่พระบาทสมเด็จพระ จุลจอมเกล้าเจ้าอยู่ หัว หรือรัชกาลที่ 5 ทรงโปรดปรานเป็นพิเศษด้วย', 'เอกลักษณ์ของแมวขาวมณี นอกจากจะมีขนสีขาวปลอดทั่วทั้งตัวแล้ว นัยน์ตาทั้ง 2 ข้างของแมวขาวมณียังแตกต่างไปจากแมวไทยพันธุ์อื่น โดยมีทั้งนัยน์ตาสีฟ้า สีเหลืองอําพัน และตา 2 สี ลักษณะมาตรฐานของแมวขาวมณีหัวจะต้องกลมใหญ่คล้ายรูปหัวใจ จมูกสั้น\nหูตั้งใหญ่ โคนหางใหญ่แต่มีปลายแหลมชี้ตรง และต้องเรียวได้สัดส่วนกับลําตัว ส่วนเสน่ห์ของแมวขาวมณีนั้น นอกจากขนสีขาวเนียนสนิท มันยังเป็นแมวที่ช่างประจบประแจง ขี้อ้อน ชอบเข้ามาคลอเคลีย และจะคอยสังเกตเจ้าของตลอด ไม่ว่าจะทําอะไรอยู่ก็ตาม', 'ส่วนมากมักจะนิยมเลี้ยงแมวขาวมณีแบบเป็นคู่ เพื่อให้พวกมันพลัดกันเลียขนเพื่อทําความสะอาด แมวพันธุ์นี้เป็นแมวเชื่อง และ\nเชื่อฟังคําสั่งเจ้าของ จึงเหมาะกับการเลี้ยงไว้เป็นเพื่อนแก้เหงาได้ดีเลยทีเดียว', 'https://img.thaicdn.net/image/cat1_002.jpg', 1),
(16, 'แมวบริติช ชอร์ตแฮร์', 'British Shorthair', 'แมวท้องถิ่นสายพันธุ์เก่าแก่ที่สุดบนเกาะอังกฤษ ซึ่งเล่ากันว่าบรรพบุรุษของพวกมันมาจากแมวที่ชาวโรมันเอามาเลี้ยงเมื่อ\n2,000 ปีก่อน และเป็นแมวที่ได้รับความนิยมอย่างมากทั้งในประเทศต้นกําเนิดและประเทศอื่น ๆ แถบยุโรปจนถึงยุคปัจจุบัน เนื่องจากมัน เป็นแมวที่มีความเฉลียวฉลาด จึงเป็นที่ชื่นชอบของผู้ฝึกสัตว์เพื่อใช้ในการโฆษณาทางโทรทัศน์หรือเข้าฉากในภาพยนตร์ของฮอลลีวูด', 'แมวบริติช ชอร์ตแฮร์ เป็นแมวที่มีลักษณะกะทัดรัด สมดุลดี แข็งแรง หน้าอกเต็มและกว้าง ขาสั้น อุ้งเท้ากลม หางหนาและกลม\nหัวกลมรับกับใบหูขนาดเล็ก คอสั้น แก้มยุ้ย คางหนา ดวงตากลมโต จมูกค่อนข้างสั้น ขนหนาและสั้น มีอายุเฉลี่ยประมาณ 15-20 ปี ส่วนอุปนิสัยของแมวพันธุ์นี้ค่อนข้างนิ่งสงบกว่าแมวพันธุ์อื่น ๆ เดาทางได้ง่าย เนื่องเป็นมิตรกับผู้คนรวมถึงสัตว์ชนิดอื่น ๆ\nปรับตัวเข้ากับสภาพแวดล้อมได้ง่าย ดังนั้นจึงไม่ค่อยพบเห็นแมวสายพันธุ์นี้ส่งเสียงรบกวน แสดงอาการก้าวร้าว หรือทําลายสิ่งของให้เห็น', 'แมวบริติช ชอร์ตแฮร์เป็นแมวที่ดูแลง่าย แต่ควรเลี้ยงในบ้าน นอกจากนี้บริติช ชอร์ตแฮร์อาจเป็นแมวที่มีพัฒนาการการ\nเจริญเติบโตช้าอยู่สักหน่อย แต่ความสมบูรณ์และความสวยงามของมันจะอยู่คู่กับแมวไปตลอดเกือบชั่วอายุขัย เลยทีเดียว', 'https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQk-JdLtJm3ZKjygFWLeLTlYY0obKZNJ3Gf6w&s', 1),
(17, 'แมวเอ็กโซติก', 'Exotic', 'แมวหน้าบูด จมูกหัก แต่น่ารักไม่แพ้ใคร เพราะสืบเชื้อสายมาจากแมว 2 สายพันธุ์ ระหว่างแมวเปอร์เซียกับแมวอเมริกัน ช็อต\nแฮร์จนกลายมาเป็นแมวเอ็กโซติก หลากหลายรูปแบบอาทิExotic Blue Tabby, Exotic Red Tabby, Exotic Cream Tabby เป็นต้น', 'ลักษณะทั่วไปของแมวเอ็กโซติกเหมือนกับแมวเปอร์เซียทุกประการ ไม่ว่าจะเป็นลักษณะหัวกลม กะโหลกใหญ่ ใบหูเล็กกลม\nจมูกหักเล็กน้อย ยกเว้นเส้นขนสั้น ๆ ที่หนานุ่มคล้ายกับกํามะหยี่อันเป็นสัญลักษณ์ของแมวสายพันธุ์นี้ ส่วนเรื่องอุปนิสัยก็แทบไม่มีแตกต่างจากแมวเปอร์เซียเลย เพราะแมวเอ็กโซติกเป็นแมวที่ซื่อสัตย์ต่อเจ้าของ ไม่ค่อยหงุดหงิด และมีความอดทนสูง ดังนั้นคุณแทบจะไม่ได้ยินเสียงร้องของแมวพันธุ์นี้แน่นอน หากมันต้องการความสนใจขึ้นมา ก็จะทําแค่นั่งอยู่หน้าคุณ กระโดดมานั่งบนตัก หรือเอาจมูกชื้น ๆ ของมันมาแตะที่หน้าคุณเท่านั้น นอกจากนี้ยังพบว่า แมวพันธุ์เอ็กโซติกบางตัวอาจจะชอบนั่งอยู่บนไหล่และกอดคุณเวลาคุณเล่นด้วย', 'ใครที่อยากเลี้ยงแมวสายพันธุ์ต่างประเทศ แต่ไม่ค่อยมีเวลาดูแลขน แมวพันธุ์เอ็กโซติกก็เป็นตัวเลือกที่น่าสนใจ เพราะมันเป็น\nแมวที่เหมาะกับการเลี้ยงไว้ในบ้าน ที่สําคัญขนอันสวยงามของแมวพันธุ์นี้ยังต้องการการบํารุงรักษาน้อยกว่าแมวเปอร์เซียทั่ว ๆ ไป เพราะ ไม่ค่อยจับตัวเป็นก้อนหรือพันกันยุ่งเหยิงอีกด้วย', 'https://img.thaicdn.net/image/pet/red-exotic.jpg', 1),
(18, 'แมวเมนคูน', 'Main Coon', 'ถึงแม้แมวเมนคูนจะมีร่างกายที่ใหญ่โตกว่าแมวปกติแต่มันกลับเป็นพี่ใหญ่ใจดี จนได้รับสมญานามว่า Gentel Giant ชื่อของ\nแมวสายพันธุ์นี้ มีที่มาจากรัฐเมน (Maine) ในสหรัฐอเมริกา ซึ่งเป็นแหล่งกําเนิดของมัน ส่วนคําว่า คูน (Coon) มาจากคําบอกเล่าของชาวพื้นเมืองที่กล่าวว่า แมวบ้านเผลอไปกุ๊กกิ๊กกับตัวแรคคูน (Raccoon) จนมีการจับ 2 คํานี้มารวมกัน กลายเป็นชื่อที่ใช้เรียกกันทั่วไปว่า เมนคูน (Main Coon)', 'ลักษณะเด่นของแมวพันธุ์เมนคูน คือ รูปร่างที่สมส่วน ดูสง่างาม และให้ความรู้สึกที่มั่นคงแข็งแรง หากเป็นแมวโตเต็มที่ ร่างกาย\nของมันจะมีความยาวตั้งแต่หัวจรดปลายหางประมาณ 1 เมตร น้ําหนักตัวอยู่ที่ประมาณ 12-15 กิโลกรัม ถึงแมวเมนคูนจะมีโครงสร้างใหญ่ ใบหน้าเหมือนกับแมวป่า มีแผงคอคล้ายสิงโต แถมบริเวณปลายหูยังมีเส้นขนงอกออกมา แต่มันกลับมีนิสัยขี้อ้อน ขี้เล่น ร่าเริง ตั้งแต่เด็กไป จนถึงวัยเจริญพันธุ์', 'อายุขัยของแมวพันธุ์อยู่ที่ราว ๆ 15 ปี เหมือนแมวทั่วไป แต่เนื่องจากร่างกายที่ค่อนข้างใหญ่โต การให้อาหารแบบแมวทั่วไปอาจ ไม่เพียงพอต่อการเจริญเติบโต ดังนั้นเจ้าของควรเสริมด้วยเนื้อสัตว์ที่มีโปรตีนสูง ไขมันต่ํา เพื่อช่วยสร้างกล้ามเนื้อให้กับมัน\nขนของแมวเมนคูนค่อนข้างหวีง่าย เนื่องจากเป็นแมวกึ่งขนยาว จึงไม่มีปัญหาขนพันกันแบบแมวเปอร์เซีย เพียงแต่ควรจะ อาบน้ําให้มันอย่างน้อยเดือนละ 2 ครั้ง และหลังการอาบน้ําทุกครั้ง ควรจะเช็ดพร้อมกับเป่าขนให้แห้งสนิท เพื่อป้องกันโรคเชื้อราบนผิวหนัง', 'https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSW6NuwtrWcUoD5VAUHeqyvzwcMg6D8oTd9tw&s', 1),
(19, 'แมวเบงกอล', 'Bengal', 'แมวเบงกอลเป็นแมวที่มีลวดลายสวยงาม คล้ายลูกเสือดาวตัวน้อย ๆ คาดกันว่า แมวเบงกอลเกิดจาการผสมพันธุ์ระหว่างแมว\nดาวกับแมวบ้านสายพันธุ์อียิปต์เชีย นมัวร์ (Egyptian Mau) ซึ่งเป็นแมวอียิปต์โบราณ ที่มีโครงสร้างเป็นลายจุด ลักษณะคล้ายแมวป่า โดย ถูกนํามาพัฒนาสายพันธุ์ ด้วยฝีมือของ Jean Mills หญิงสาวชาวอเมริกัน ที่หลงใหลคลั่งไคล้ในลวดลายของแมวป่า พร้อมกับตั้งชื่อของมัน ตามชื่อวิทยาศาสตร์ของแมวป่าที่เรียกกันว่า Felis Bengolensis', 'แมวเบงกอลเป็นแมวขนาดปานกลางถึงค่อนข้างใหญ่ หัวมีความยาวมากกว่าความกว้าง เช่นเดียวกับรูปร่างที่มีลักษณะเพรียว\nยาว เห็นมัดกล้ามเนื้อชัดเจนคล้ายแมวป่า เมื่อมองจากด้านข้างจะเห็นว่า ช่วงสะโพกมีความสูงกว่าหัวไหล่ ปลายหางชี้ลง ใบหูกลมสั้น ตา\nรูปไข่ มีช่วงปากกับจมูกกลมกว่าแมวบ้าน และมีจุดเด่นอยู่ที่ลายขนคล้ายแมวป่า หรือที่เรียกกันว่า ลายหินอ่อนถึงแม้แมวเบงกอลจะสืบสายพันธุ์มาจากแมวป่า แต่พวกมันกลับมีนิสัยน่ารักไม่ดุร้ายอย่างที่คิด แถมยังเป็นมิตรกับทุกคนเสียด้วย นอกจากนี้แมวเบงกอลยังเป็นแมวที่ซุกซน เพราะชอบวิ่งไล่สิ่งของต่าง ๆ รวมทั้งชอบปีนป่ายขึ้นที่สูงอยู่เป็นประจํา ที่สําคัญแมวพันธุ์นี้ ชอบเล่นน้ําเอามาก ๆ ด้วย', 'การเลี้ยงดูแมวเบงกอลก็เหมือนกับการดูแลแมวทั่วไป แต่ถ้าอยากให้มันมีสุขภาพดีและมีขนที่สวยงาม ควรใส่ใจในเรื่องอาหาร เป็นพิเศษ โดย ต้องเพิ่มเมนูเนื้อวัวสดจากอาหารที่กินเป็นประจํา ซึ่งเนื้อสดที่ให้ก็ต้องผ่านการเก็บรักษาด้วยการแช่แข็ง เพื่อป้องกันการ\nเจริญเติบโตของเชื้อรากับแบคทีเรีย และห้ามให้เนื้อไก่หรือเนื้อหมูโดยเด็ดขาด', 'https://img.thaicdn.net/u/2018/Jarosphan/Pet/Cat/170/02.jpg', 1);

--
-- Indexes for dumped tables
--

--
-- Indexes for table `catbreeds`
--
ALTER TABLE `catbreeds`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `catbreeds`
--
ALTER TABLE `catbreeds`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=21;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
